//TASK-1
let course = +prompt('Курсыңызды енгізіңіз 1/2/3/4');
let isAlmaty = prompt('Келген жеріңіз Алматы ма? Yes/No');
if(course < 3 && isAlmaty == 'No'){
    alert('Құттықтаймыз! Сізге жатақханадан орын беріледі')
}
else{
    alert('Өкінішке орай! Сізге жатақханадан орын берілмейді')
}

//TASK-2
alert('Ойын шарты: Дұрыс жауап берілген әр сұраққа 1 балл беріледі' + '\n' + 'Сұрақ қойылады жауап енгізесіз')
let question1 = +prompt('Қазақстан тәуелсіздігін қашан алды?')
let question2 = prompt('Қазір қай қалада оқып жатырсыз (Алматы + 1 / Басқасы -1)?')
if(question1 == 1991 && question2 == 'Almaty'){
    alert('Сіз 2 ұпай жинадыңыз')
}
else{
    alert('Өкінішке орай! Сіз жеңілдіңіз')
}

